dataset_gen/Hole_Location_Change/CE_CRP_openfoam/Design_Point_0_copy_2/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0) // v0
    (0.882812 0 0) // v1
    (0.945312 0 0) // v2
    (1 0 0) // v3
    (0 0.585938 0) // v4
    (0.882812 0.585938 0) // v5
    (0.945312 0.585938 0) // v6
    (1 0.585938 0) // v7
    (0 0.648438 0) // v8
    (0.882812 0.648438 0) // v9
    (0.945312 0.648438 0) // v10
    (1 0.648438 0) // v11
    (0 1 0) // v12
    (0.882812 1 0) // v13
    (0.945312 1 0) // v14
    (1 1 0) // v15
    (0 0 0.1) // v16
    (0.882812 0 0.1) // v17
    (0.945312 0 0.1) // v18
    (1 0 0.1) // v19
    (0 0.585938 0.1) // v20
    (0.882812 0.585938 0.1) // v21
    (0.945312 0.585938 0.1) // v22
    (1 0.585938 0.1) // v23
    (0 0.648438 0.1) // v24
    (0.882812 0.648438 0.1) // v25
    (0.945312 0.648438 0.1) // v26
    (1 0.648438 0.1) // v27
    (0 1 0.1) // v28
    (0.882812 1 0.1) // v29
    (0.945312 1 0.1) // v30
    (1 1 0.1) // v31
);

blocks
(
    hex (0 1 5 4 16 17 21 20) (113 75 1) simpleGrading (1 1 1)
    hex (1 2 6 5 17 18 22 21) (8 75 1) simpleGrading (1 1 1)
    hex (2 3 7 6 18 19 23 22) (7 75 1) simpleGrading (1 1 1)
    hex (4 5 9 8 20 21 25 24) (113 8 1) simpleGrading (1 1 1)
    hex (6 7 11 10 22 23 27 26) (7 8 1) simpleGrading (1 1 1)
    hex (8 9 13 12 24 25 29 28) (113 45 1) simpleGrading (1 1 1)
    hex (9 10 14 13 25 26 30 29) (8 45 1) simpleGrading (1 1 1)
    hex (10 11 15 14 26 27 31 30) (7 45 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    // -------------------------------
    // (A) LEFT boundary (x=0)
    left
    {
        type    cyclic;  // or "wall" or "cyclic"
        neighbourPatch  right;
        faces
        (
            (0 4 20 16)
            (4 8 24 20)
            (8 12 28 24)
        );
    }

    // -------------------------------
    // (B) RIGHT boundary (x=1)
    right
    {
        type    cyclic;  // or "wall" or "cyclic"
        neighbourPatch  left;
        faces
        (
            (3 7 23 19)
            (7 11 27 23)
            (11 15 31 27)
        );
    }

    // -------------------------------
    // (C) BOTTOM boundary (y=0)
    bottom
    {
        type    cyclic;  // or "wall" or "cyclic"
        neighbourPatch  top;
        faces
        (
            (0 1 17 16)
            (1 2 18 17)
            (2 3 19 18)
        );
    }

    // -------------------------------
    // (D) TOP boundary (y=1)
    top
    {
        type    cyclic;  // or "wall" or "cyclic"
        neighbourPatch  bottom;
        faces
        (
            (12 13 29 28)
            (13 14 30 29)
            (14 15 31 30)
        );
    }

    // -------------------------------
    // (E) HOLE boundary (inner ring)
    hole
    {
        type    wall;  // no-slip wall
        faces
        (
            (5 6 22 21)
            (5 9 25 21)
            (6 10 26 22)
            (9 10 26 25)
        );
    }

    // -------------------------------
    // (F) FRONT-AND-BACK boundary
    frontAndBack
    {
        type    empty;
        faces
        (
            (0 1 5 4)
            (16 20 21 17)

            (1 2 6 5)
            (17 21 22 18)

            (2 3 7 6)
            (18 22 23 19)

            (4 5 9 8)
            (20 24 25 21)

            (6 7 11 10)
            (22 26 27 23)

            (8 9 13 12)
            (24 28 29 25)

            (9 10 14 13)
            (25 29 30 26)

            (10 11 15 14)
            (26 30 31 27)
        );
    }
);

mergePatchPairs
(
);

